[
  {
    "title": "Cryptographic Verification: A Strategy for U.S. AI Export Leadership",
    "slug": "cryptographic-verification-a-strategy-for-us-ai-export-leadership",
    "date": "2025-11-03",
    "author": "Kristian Rönn",
    "tags": [
      "National Security",
      "AI Trade Policy",
      "AI Security",
      "Export Controls"
    ],
    "image": "media/pE4sNBZQBMDmfBnLeT4iNAVf9V0.png",
    "description": "Turning Sovereign AI Requirements into U.S. Export Opportunities",
    "content": "<h1 id=\"cryptographic-verification-a-strategy-for-us-ai-export-leadership\">Cryptographic Verification: A Strategy for U.S. AI Export Leadership</h1>\n\n<h2 id=\"the-problem-ai-trade-barriers\">The Problem: AI Trade Barriers</h2>\n\n<p>The ambitious U.S. strategy to export the full American AI technology stack has encountered a powerful and predictable countervailing force: the global rise of digital nationalism. The long-held assumption of a single, integrated global digital market has gradually been rendered obsolete. In its place, a fragmented landscape of “regulatory fiefdoms” has emerged, driven by a deep-seated desire among nations to assert control over their digital futures.</p>\n\n<p>The global pursuit of “Sovereign AI” is a direct response to recent history. Supply chain disruptions and the clear strategic implications of technological dependence have alarmed governments worldwide. As a result, nations are launching multi-billion-dollar initiatives not just to participate in the AI economy, but to control their own AI infrastructure, data, and models. This has created a paradoxical environment for American technology providers. On one hand, the race for sovereign AI has generated unprecedented demand for U.S.-designed hardware, as allied nations rush to build domestic compute capacity. On the other hand, to ensure this new infrastructure is truly “sovereign,” these same nations are erecting complex regulatory barriers that govern data storage, model management, and content control, directly threatening the high-margin software and services that run on that hardware.</p>\n\n<p>The core of the problem lies in a fundamental conflict of interests. The United States, motivated by legitimate national security and economic concerns, seeks maximum control and visibility over its exported technology. This is essential to prevent misuse, protect intellectual property, and ensure the technology cannot be turned against American interests.</p>\n\n<p>Conversely, “sovereign buyers”—from highly regulated markets in the European Union to ambitious emerging powers in Asia and the Middle East—demand the exact opposite. They seek maximum sovereignty, which they define as complete control over their critical digital infrastructure and the data that flows through it. They are increasingly skeptical of relying on a technology stack that is ultimately beholden to the laws and strategic interests of another nation. This skepticism is actively fueled by competitors like China, which promotes a narrative of American untrustworthiness, warning of hidden “backdoors” and “kill switches” in U.S. technology. This narrative erodes the trust necessary for deep technological partnerships and makes the sale of an American-controlled stack more challenging.</p>\n\n<p>This conflict manifests as a web of national and regional regulations that will increasingly pose barriers to entry in key global markets. The EU’s data localization rules, for example, could favor local European cloud providers if US providers cannot provide robust guarantees on where the data goes. Similar trends are arising in the Middle East and Asia. To win the infrastructure race, the United States must offer a solution that seamlessly and technically addresses these sovereignty concerns, moving beyond legal assurances to provide demonstrable proof.</p>\n\n<h2 id=\"the-solution-trust-through-cryptographic-verification\">The Solution: Trust Through Cryptographic Verification</h2>\n\n<p>In the current zero-trust geopolitical environment, policy assurances and contractual obligations are insufficient to overcome the sovereignty paradox. A sovereign buyer concerned about a “kill switch” or data access under the U.S. CLOUD Act will not be placated by a clause in a service-level agreement. One viable path to resolving this trust deficit is to build the American AI stack on a foundation of cryptographic verification. This approach moves the basis of trust from the identity of the operator to the provable mathematical properties of the system itself, offering sovereign buyers demonstrable proof of compliance and control.</p>\n\n<p>The strategic challenge is to bridge the gap between the promise of security and the proof of it. The American technology stack must evolve from a model that says, “We promise not to access your data,” to one that can state, “We have cryptographic protections that make unauthorized access extremely difficult and detectable, and we can prove it to you on demand.” This shift from policy-based compliance to evidence-based assurance is the key to unlocking high-friction international markets.</p>\n\n<p>This new paradigm of demonstrable proof is made possible by a confluence of mature technologies that, when integrated, provide a verifiable chain of trust from the silicon to the application.</p>\n\n<h3 id=\"confidential-computing--trusted-execution-environments-tees\">Confidential Computing &amp; Trusted Execution Environments (TEEs)</h3>\n\n<p>TEEs are secure, isolated areas within a main processor, such as those provided by Intel SGX/TDX or AMD SEV. They create protected memory enclaves where code and data are isolated during processing. Even an administrator with root privileges on the host operating system—or the cloud provider itself—cannot see or modify what is inside the TEE. This provides a powerful guarantee of data confidentiality and code integrity.</p>\n\n<h3 id=\"hardware-roots-of-trust-hrot\">Hardware Roots of Trust (HRoT)</h3>\n\n<p>An HRoT, typically a Trusted Platform Module (TPM), is a dedicated microchip designed to provide secure hardware-based functions. It acts as the immutable foundation of trust for a computing platform. It can securely store cryptographic keys and, most importantly, can measure (cryptographically hash) the state of the system’s firmware and software during the boot process, creating a secure log of the platform’s configuration.</p>\n\n<h3 id=\"remote-attestation\">Remote Attestation</h3>\n\n<p>This is the protocol that makes the internal state of the system visible to an external party. A remote user (the sovereign buyer) can challenge the TEE or TPM. In response, the hardware provides a signed report containing the measurements of the software running on the system. This report is signed with a cryptographic key that is fused into the silicon and can be verified against the manufacturer’s public key. This allows the buyer to receive strong cryptographic evidence of the hardware and software configuration at boot time where their workload is running, confirming that it has not been tampered with and matches an approved configuration.</p>\n\n<p>This fundamental security architecture is not just confined to CPUs; it is now a critical design pillar across the spectrum of modern AI accelerators. Recognizing that proprietary AI models and sensitive training datasets are immensely valuable assets, manufacturers like NVIDIA, AMD, Intel, and Google embed these hardware primitives directly into their GPUs and TPUs. These foundational technologies enable a range of specific, verifiable guarantees that directly address the concerns of sovereign buyers. These guarantees are not abstract principles but concrete deployment-ready capabilities that the American AI Technology Stack can provide to meet the demand for sovereignty from global customers.</p>\n\n<ul>\n  <li><strong>A. Data Residency:</strong> Is all data processing and storage confined within our nation’s jurisdiction?</li>\n  <li><strong>B. Confidentiality:</strong> Is citizen and business data encrypted and protected from all unauthorized access?</li>\n  <li><strong>C. Benchmarks:</strong> Has the AI model been validated against our national benchmarks for performance, safety, and compliance?</li>\n  <li><strong>D. Usage:</strong> Does the data center, including all model training activities, adhere to local regulations and compute usage restrictions?</li>\n</ul>\n\n<p>Verifiable guarantees fundamentally alter the power dynamic between the technology provider and the sovereign customer. A U.S. company can build and operate the world’s most advanced AI infrastructure, while a foreign government or enterprise can use that infrastructure with strong cryptographic assurances that their data and workloads remain exclusively under their control. While customers must still trust the underlying hardware manufacturers and implementation, the reliance on trusting the provider’s legal entity or home jurisdiction is substantially reduced—the basis of trust shifts toward verifiable technical controls rather than policy commitments alone.</p>\n\n<p>Furthermore, a platform architected around these principles can transform regulatory compliance from a manual, periodic, and costly audit process into a more automated, semi-continuous, and technically verifiable process. Instead of an auditor reviewing logs to verify data residency, the platform can generate cryptographic attestations that provide strong evidence that a workload ran exclusively on servers within a specific national border and in an isolated environment configured to restrict external network access. This allows U.S. firms to sell verification as a premium, high-margin service, turning trade barriers into a source of competitive advantage, especially in relation to the Chinese AI Technology Stack.</p>\n\n<h2 id=\"deployment-configurations-a-framework-for-global-markets\">Deployment Configurations: A Framework for Global Markets</h2>\n\n<p>A successful global deployment strategy requires a nuanced understanding of the different ways the American AI stack can be configured, and what international trade barriers exist around each such configuration. The following three-axis model provides a framework for analyzing deployments:</p>\n\n<h3 id=\"axis-1-operator-the-who\">Axis 1: Operator (The “Who”)</h3>\n\n<ul>\n  <li><strong>O1: US Entity:</strong> The data center is built, owned, or operated by a U.S. corporation (e.g., AWS, Oracle) or a U.S. government entity.</li>\n  <li><strong>O2: Host Nation Entity:</strong> The data center is operated by a non-U.S. entity, such as a private French company, a German state-owned utility, or a sovereign wealth fund.</li>\n</ul>\n\n<h3 id=\"axis-2-jurisdiction-the-where\">Axis 2: Jurisdiction (The “Where”)</h3>\n\n<ul>\n  <li><strong>J1: US Homeland:</strong> The physical data center is located in the United States and is subject to U.S. law, with foreign customers accessing it remotely.</li>\n  <li><strong>J2: Partner Nation (Regulated):</strong> The physical data center is located within the borders of a partner nation (e.g., France, Germany, Japan) and is subject to its local laws, such as GDPR.</li>\n</ul>\n\n<h3 id=\"axis-3-technology-stack-the-what\">Axis 3: Technology Stack (The “What”)</h3>\n\n<ul>\n  <li><strong>S1: US Model on US Hardware:</strong> The complete American stack, featuring a U.S.-developed AI model running on U.S.-designed hardware.</li>\n  <li><strong>S2: US Model on Foreign Hardware:</strong> A U.S. AI model running on hardware from a non-U.S. manufacturer.</li>\n  <li><strong>S3: Foreign Model on US Hardware:</strong> A foreign-developed AI model (e.g., France’s Mistral) running on U.S.-designed hardware.</li>\n  <li><strong>S4: Foreign Model on Foreign Hardware:</strong> A completely non-U.S. technology stack.</li>\n</ul>\n\n<p>These axes define a spectrum of deployment scenarios, each with unique trust and regulatory implications. For example, an O1/J1/S1 deployment (AWS running a U.S. model in Virginia) is the default for many U.S. customers but is the most challenging to sell into high-sovereignty markets. Conversely, an O2/J2/S3 deployment (a German company running a French model on U.S. hardware in Frankfurt) presents a very different proposition that can be tailored to meet stringent EU requirements. The strategic goal should not be to force a single configuration on the world, but to sell a verifiable platform that enables a menu of secure, sovereign-respecting configurations. The product is not the stack; the product is verifiable trust.</p>\n\n<h2 id=\"overcoming-the-industry-coordination-problem\">Overcoming the Industry Coordination Problem</h2>\n\n<p>The primary obstacle to deploying a verifiably sovereign American AI Technology Stack is not a lack of technology, but a classic industry coordination problem. The capabilities for verification, based on technologies such as confidential computing and cryptographic attestation exist, yet they remain siloed within specific layers of the technology stack, making it difficult to deliver the integrated, end-to-end assurance that sovereign buyers demand. For example, a chip maker like Intel can attest to its hardware security properties, a cloud provider like Amazon can attest that a virtual machine is running on that chip, and an AI company can attest that its model is untampered with—but these attestations are not standardized or easily composable, leaving the customer unable to verify the entire process end-to-end through a single, unified chain of evidence.</p>\n\n<p>This creates a “chicken-and-egg” problem. While vital work on technical standards is underway in bodies like the Confidential Computing Consortium, Internet Engineering Task Force, and the Open Compute Project, the traditional process of industry-wide consensus and adoption takes decades. Crucially, the United States does not have decades. To win the current AI arms race and secure its technological leadership, it must solve this problem during this presidency. To effectively address the industry coordination problem, the Request for Proposal (RFP) for the American AI Technology Stack should be enhanced to cultivate products for digital trust. This can be achieved by embedding two core principles into the RFP requirements:</p>\n\n<h3 id=\"1-mandate-integration-with-independent-verification-technology-providers\">1) Mandate Integration with Independent Verification Technology Providers</h3>\n\n<p>The RFP should explicitly require that all submitted “full-stack AI technology packages” are integrated with a Third-Party Verification Technology Provider. These providers—which include the existing market of technical audit firms, privacy platforms, and cybersecurity companies—would be responsible for aggregating and presenting the cryptographic attestations that build customer trust in privacy, data residency, and system configuration. Their third-party independence is crucial for building impartial trust, as it avoids the inherent conflict of interest that arises when a technology provider, such as a hyperscaler, verifies its own systems.</p>\n\n<p>Moreover, by making third-party verification a prerequisite for purchase, the financial burden of complying with international AI trade barriers shifts from American technology companies to the sovereign buyers themselves. This strategic shift not only alleviates the compliance costs but also cultivates a new, lucrative market for American firms specializing in verification technology.</p>\n\n<h3 id=\"2-align-federal-incentives-to-build-the-verification-market\">2) Align Federal Incentives to Build the Verification Market</h3>\n\n<p>The RFP should directly link the federal financing tools mentioned in the Executive Order to the costs incurred by both the stack providers and their Verification Technology Provider partners. This approach addresses the current economic misalignment by funding the development and integration of the verification layer. By offering loans, guarantees, and other de-risking mechanisms, the government can accelerate the creation of a robust and competitive verification market.</p>\n\n<p>A priority AI export package selected under these terms would help establish a de facto industry standard for verifiable sovereignty, positioning the American AI Technology Stack as not only the most powerful but also the most demonstrably trustworthy solution for sovereign buyers on the global stage.</p>\n"
  },
  {
    "title": "Navigating the Maze of AI and Data Sovereignty in the EU",
    "slug": "navigating-the-maze-of-ai-and-data-sovereignty-in-the-eu",
    "date": "2025-08-29",
    "author": "Connor Dunlop",
    "tags": [
      "Data Sovereignty",
      "EU Policy",
      "AI Security"
    ],
    "image": "media/TAgIxThuWHOm5a9n0FTDD5ddk.png",
    "description": "Can hardware-rooted attestation provide a verifiable proof of compliance across EU regulations?",
    "content": "<h1 id=\"navigating-the-maze-of-ai-and-data-sovereignty-in-the-eu\">Navigating the Maze of AI and Data Sovereignty in the EU</h1>\n\n<p>Governments across the European Union are increasingly focused on AI and data sovereignty. This trend is driven by a range of new regulations, from broad frameworks like the EU Cybersecurity Act to sectoral rules such as health, finance, government and defence. </p>\n\n<p>For any organisation in Europe’s digital ecosystem - from cloud, hardware, and network infrastructure providers to the public and private sector entities deploying critical systems - navigating this landscape has become a strategic necessity.</p>\n\n<p>In this post, we’ll break down the key regulations driving these sovereignty obligations and introduce our solution for seamlessly and securely proving the sovereignty of your critical AI workloads and data: Sovereign Certificates.</p>\n\n<h2 id=\"the-foundation-the-eu-cybersecurity-act-csa-and-eucs\">The Foundation: The EU Cybersecurity Act (CSA) and EUCS</h2>\n\n<p>The EU Cybersecurity Act (CSA) serves as the legal foundation for harmonised, EU-wide cybersecurity certifications. It doesn’t list specific controls but creates the rulebook for schemes like the upcoming EU Cloud Certification Scheme (EUCS).</p>\n\n<p>A critical part of the CSA is Article 52, which defines three “assurance levels”:</p>\n\n<ul>\n  <li>\n    <p><strong>Basic:</strong> Protects against known risks.</p>\n  </li>\n  <li>\n    <p><strong>Substantial:</strong> Protects against attackers with limited resources.</p>\n  </li>\n  <li>\n    <p><strong>High:</strong> strongest assurance for critical use cases.</p>\n  </li>\n</ul>\n\n<p>This ‘High’ level provides the legal justification for embedding sovereignty requirements into EU-wide certifications. Drafts of the EUCS have considered doing just that by defining a key security objective as protecting data from unlawful access by third-country authorities, directly justifying the need for sovereignty controls. </p>\n\n<p><strong>Raising the bar: France’s SecNumCloud</strong></p>\n\n<p>SecNumCloud has already implemented strict sovereignty criteria. Drafted by the French cybersecurity agency (ANSSI),  it is currently the strictest sovereignty-focused certification in Europe. It goes far beyond simple data localisation to make a provider legally and structurally immune to non-EU legal overreach.</p>\n\n<p>Key sovereignty requirements in SecNumCloud include:</p>\n\n<ul>\n  <li>\n    <p><strong>Protection Against Non-EU Law:</strong> The provider’s corporate structure and headquarters must be in the EU. Strict limits are placed on non-EU ownership. </p>\n  </li>\n  <li>\n    <p><strong>Data and Operations Localisation:</strong> All customer and technical data, as well as all administration and supervision, must be located and performed within the EU.</p>\n  </li>\n  <li>\n    <p><strong>Legal Framework:</strong> Service agreements must be governed by the law of an EU member state.</p>\n  </li>\n</ul>\n\n<h2 id=\"a-sector-specific-example-the-european-health-data-space-ehds\">A Sector-Specific Example: The European Health Data Space (EHDS) </h2>\n\n<p>The trend towards sovereignty is particularly clear in critical sectors. The <strong>European Health Data Space (EHDS)</strong> is a prime example. This regulation aims to create a single market for digital health data, allowing researchers and innovators to access high-quality health data for the public good (known as “secondary use”).</p>\n\n<p>To protect this highly sensitive information, the EHDS regulation mandates that this data can only be accessed and processed within <strong>secure processing environments</strong>. A core requirement is that these environments must be physically and operationally managed <strong>within the EU</strong>. Crucially, data within these environments <strong>cannot be transferred to or accessed from third countries</strong>. This creates a clear, legally binding sovereignty requirement for anyone wanting to access European health data via this initiative. </p>\n\n<h2 id=\"sector-specific-driver-2-finance-and-the-digital-operational-resilience-act-dora\">Sector-Specific Driver 2: Finance and the Digital Operational Resilience Act (DORA) </h2>\n\n<p>Similarly, the financial sector is facing intense pressure to guarantee sovereignty. The <strong>Digital Operational Resilience Act (DORA)</strong> harmonizes digital resilience rules for all financial entities in the EU. </p>\n\n<p>A key focus for supervisory authorities, including the <strong>European Central Bank (ECB)</strong>, is the sector’s heavy reliance on external cloud providers. Recent ECB guidance on outsourcing signals increasing scrutiny on the <strong>location of hosted data and operations</strong>. This is pushing banks, insurers, and investment firms to demand stronger guarantees of data sovereignty to ensure their operational resilience and regulatory compliance under DORA.</p>\n\n<h2 id=\"our-solution-sovereignty-certificates\">Our Solution: Sovereignty Certificates</h2>\n\n<p>Navigating these complex requirements can be both burdensome and technically unverifiable: usually relying on strict but blunt operational or personnel controls and contractual promises, not verifiable proof. <strong>Sovereignty Certificates offer a streamlined, targeted solution</strong> to ensure customers can simply and securely verify that their AI workloads and related data remain within their chosen jurisdiction. These both compliment and are meaningfully differentiated from the sovereignty standards mentioned in this article:</p>\n\n<ul>\n  <li>\n    <p><strong>Complementary:</strong> By meeting our standard, your organisation implements the core technical sovereignty controls required by SecNumCloud, the proposed ‘High’ level of the EUCS, and sector-specific rules like the EHDS. This simplifies the path to full certification and helps meet obligations under the GDPR, Data Act, and ISO 27001.</p>\n  </li>\n  <li>\n    <p><strong>Differentiated:</strong> For customers who need to guarantee sovereignty without the overhead of a full SecNumCloud qualification, our certificates provide a powerful “Sovereignty Guarantee.” This unlocks new, sensitive sectors like health and finance, offering a distinct competitive advantage.</p>\n  </li>\n</ul>\n\n<p>The gap between regulatory requirements and technical capabilities is widening. While regulations demand proof, traditional approaches offer only promises. Sovereignty Certificates bridge that gap with hardware-rooted verification that regulators can trust and customers can verify.</p>\n\n<h2 id=\"annex---eu-legislation-incentivising-digital-sovereignty\">Annex - EU Legislation Incentivising Digital Sovereignty</h2>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>EU Law / Regulation</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Key Sovereignty Incentive(s)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>How it Works (Simplified)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>EU Cybersecurity Act (CSA)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Creates a legal basis for sovereignty requirements in EU-wide certifications.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>The Act’s <strong>‘High’ assurance level</strong> is designed to protect against state-level threats, justifying the need for controls against non-EU legal access.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>EUCS (Proposed)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Aims to create a harmonized, high-assurance “sovereign cloud” standard for the EU.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>The draft scheme proposes mandatory EU-based corporate structures and technical immunity from non-EU laws for its highest level of certification.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Data Act</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Legally protects EU data from unlawful third-country government access requests. Facilitates switching between cloud providers to prevent vendor lock-in.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>It requires providers to reject non-EU government access requests unless they are based on an international treaty and removes technical/financial barriers to switching services.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>GDPR</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Imposes strict conditions on the transfer of personal data outside the EU.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Data transfers to third countries are only permitted if that country provides an “adequate” level of data protection, creating a strong incentive to keep data within the EU.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>NIS2 Directive</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Mandates that critical entities secure their supply chains and manage risks from ICT suppliers.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Forces essential entities (in energy, transport, health, etc.) to scrutinize their cloud providers, favoring those who can guarantee data and operations are managed within the EU to minimize supply chain risks.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Digital Operational Resilience Act (DORA)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Requires financial entities to manage and control risks from third-party ICT providers, including cloud services.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Pushes financial firms to demand stronger guarantees on data location and operational control from suppliers to ensure resilience and reduce cross-border dependency risks.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>European Health Data Space (EHDS)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Mandates a sovereign environment for the use of health data for research and innovation.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>The regulation requires that sensitive health data for secondary use is only processed in a secure environment within the EU, with no access from third countries.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>SecNumCloud (France)</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Provides a clear, auditable “gold standard” for what a sovereign service looks like.</td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>Although a national standard, its strict rules on EU ownership, control, and operations heavily influence the EU-level debate and the design of the EUCS.</td>\n    </tr>\n  </tbody>\n</table>\n"
  },
  {
    "title": "AI Exports at Scale Require Verification, Not Just Counting",
    "slug": "ai-exports-at-scale-require-verification-not-just-counting",
    "date": "2025-08-08",
    "author": "Kristian Rönn",
    "tags": [
      "National Security",
      "AI Trade Policy",
      "AI Security",
      "Export Controls"
    ],
    "image": "media/wbfAO30etTdjdRF5oESER55KaA.png",
    "description": "To fulfill the promise of the AI Action Plan, export controls must evolve beyond physical counting and embrace scalable, hardware-rooted verification.",
    "content": "<h1 id=\"ai-exports-at-scale-require-verification-not-just-counting\">AI Exports at Scale Require Verification, Not Just Counting</h1>\n\n<h2 id=\"introduction-the-gap-between-policy-assumptions-and-technical-reality\">Introduction: The Gap Between Policy Assumptions and Technical Reality</h2>\n\n<p>In his July 30, 2025 address at the Center for Strategic and International Studies, White House Office of Science and Technology Policy Director Michael Kratsios outlined the Trump Administration’s approach to AI export control enforcement. While acknowledging resource constraints at the Bureau of Industry and Security (BIS), Kratsios expressed confidence that physical chip tracking presents manageable challenges, characterizing AI hardware as “massive racks that are tons in weight” that are difficult to relocate and easy to monitor—implying that simple physical inspections could suffice.</p>\n\n<p>This assessment, while reflecting legitimate policy optimism with the sensible aim of scaling American AI exports rapidly and securely, appears to underestimate both the technical portability of export-controlled AI accelerators and the effective methods already being used to circumvent those export controls. Recent high-profile cases of AI chip smuggling and transshipment efforts  reveal a more complex enforcement challenge that requires technological solutions beyond traditional physical inspection approaches. Fortunately, there are scalable technical solutions that can effectively verify the location and status of AI chips, providing the “tools that BIS needs to do the enforcement activities” which Kratsios rightly signalled is necessary to secure American AI dominance.</p>\n\n<h2 id=\"the-portability-reality-individual-components-not-integrated-systems\">The Portability Reality: Individual Components, Not Integrated Systems</h2>\n\n<h3 id=\"technical-specifications-contradict-immobility-claims\">Technical Specifications Contradict Immobility Claims</h3>\n\n<p>The characterization of AI chips as immobile infrastructure misconstrues their actual technical attributes. Export-controlled AI accelerators are individual, highly portable components rather than integrated rack systems. As one customs official noted in recent smuggling case documentation, individual AI accelerators are “comparable in size to a Nintendo Switch” rather than massive installations requiring industrial equipment for transport.</p>\n\n<p><strong>NVIDIA H100 PCIe Specifications:</strong></p>\n<ul>\n  <li><strong>Weight</strong>: 2-5 pounds per card</li>\n  <li><strong>Form Factor</strong>: Standard dual-slot PCIe component</li>\n  <li><strong>Power Draw</strong>: 350W (within desktop system envelopes)</li>\n  <li><strong>Dimensions</strong>: Comparable to a large graphics card</li>\n</ul>\n\n<p>This modularity has real enforcement implications. Modern server architectures specifically enable hot-swappable accelerator modules. Of a typical $50,000 AI server cost, approximately $40,000 represents the accelerator cards themselves—components that can be removed in minutes while leaving empty enclosures that appear fully operational during casual inspection. With accelerator modules accounting for the bulk of server value, actors on the BIS entity list can readily remove or transship controlled components through global gray markets while leaving enclosures behind that appear operational.</p>\n\n<h3 id=\"documented-cases-of-physical-diversion-demonstrate-practical-challenges\">Documented Cases of Physical Diversion Demonstrate Practical Challenges</h3>\n\n<p>These challenges aren’t theoretical. Enforcement authorities have uncovered multiple instances in recent months that demonstrate just how easily AI chips can be diverted and the sophisticated methods already employed to circumvent the current export control system.</p>\n\n<p><strong>Singapore Smuggling Network (2025):</strong> Authorities charged three individuals with smuggling $390 million worth of NVIDIA chips, including H100 and B200 models. The operation successfully transported individual accelerator cards through standard commercial channels before detection.</p>\n\n<p><strong>Student Transport Methods:</strong> Documentation reveals students successfully transported 6 NVIDIA compute cards in personal luggage, declaring them at $100 each to customs authorities. The compact nature of individual accelerators enables concealment within routine travel patterns.</p>\n\n<p><strong>Commercial-Scale Evasion:</strong> Reuters reported that “over $1 billion worth of banned NVIDIA chips entered China in Q2 2025 alone” through various smuggling networks. These operations relied on the portability of individual components rather than attempting to relocate entire server systems.</p>\n\n<h2 id=\"the-chinese-ai-training-ecosystem-built-on-smuggled-hardware\">The Chinese AI Training Ecosystem: Built on Smuggled Hardware</h2>\n\n<h3 id=\"deepseek-and-the-underground-economy\">DeepSeek and the Underground Economy</h3>\n\n<p>Recent analysis suggests that Chinese AI capabilities, including breakthrough models like DeepSeek, rely heavily on smuggled NVIDIA hardware. A <a href=\"https://www.cnas.org/publications/reports/countering-ai-chip-smuggling-has-become-a-national-security-priority\">recent report from the Center for a New American Security</a> showed that over 100,000 export controlled chips were smuggled into China in 2024 alone, with a median estimate of 140,000 chips. Public reporting cited documents individual graymarket orders worth up to $120 million for shipments of thousands of H100 chips.</p>\n\n<p><strong>Gray Market Pricing Indicates Robust Demand:</strong> Market signals corroborate these findings. Smuggled H100s in China sell in gray markets for significant markups—often exceeding 50% over U.S. MSRP—commanding prices of $45,000 or more per chip. This price differential indicates both substantial demand and successful supply networks operating beyond regulatory oversight.</p>\n\n<p><strong>Training Infrastructure Adaptation:</strong> Chinese research institutions have developed sophisticated techniques for maximizing training efficiency using smaller, distributed clusters of smuggled hardware. As one industry analyst observed, “Chinese labs are training 90% of their models using smuggled components integrated into seemingly legitimate research infrastructure.”</p>\n\n<h3 id=\"underground-support-networks\">Underground Support Networks</h3>\n\n<p><strong>Shenzhen Repair Services:</strong> Underground repair services in Shenzhen now handle “500 banned GPU repairs monthly,” indicating a mature support ecosystem for smuggled hardware. These services provide the technical infrastructure necessary to maintain operational capability for components obtained through illicit channels.</p>\n\n<p><strong>Shell Company Aggregation:</strong> Chinese firms have established “multiple shell companies placing small orders across third countries to aggregate restricted hardware,” according to CNAS research. This approach exploits regulatory thresholds while building substantial computational capabilities.</p>\n\n<h2 id=\"bis-resource-constraints-the-enforcement-reality\">BIS Resource Constraints: The Enforcement Reality</h2>\n\n<p><strong>Personnel and Capability Limitations:</strong> Several policymakers have expressed unwarranted optimism about the ease of AI export control enforcement—often grounded in technical misunderstandings about how modular, high-value AI accelerators can be moved, hidden, or repurposed. With only <a href=\"https://www.gao.gov/assets/gao-25-107431.pdf?utm_source=chatgpt.com\">a portion of 585 positions overseeing $486.4 billion</a> in annual licensed exports, BIS and its other government partners operate under real-world constraints. The task of overseeing hundreds of billions of dollars in dual-use technologies with limited personnel and global reach is an inherently difficult mission. And despite the dedication of its staff, BIS must operate in a system where traditional tools—periodic inspections, documentation audits, and license compliance checks—were not designed with modular AI accelerators in mind. The Government Accountability Office noted that BIS field offices “lack analytical tools and personnel for systematic risk analyses” and have “no systematic approach to identifying high-risk entities.” In short, physical counting approaches simply exceed current BIS operational capabilities.</p>\n\n<p>Compounding the challenge, frontline export control officers—of which BIS has only dozens to monitor global compliance—often lack access to real-time risk assessments or specialized inspection tools. Field inspections may catch obvious violations, but they are not well-equipped to detect partial diversion, distributed system assembly, or chip-level concealment. Legitimate industry stakeholders, meanwhile, frequently voice concern about the operational burden of traditional compliance mechanisms, especially when physical inspections risk downtime or data disruption. These constraints reflect systemic design gaps, not lack of effort.</p>\n\n<p>To succeed in this new environment, enforcement strategies must evolve alongside the technology landscape they are meant to secure.</p>\n\n<p><strong>Customer Impact and Operational Challenges</strong></p>\n\n<p><strong>Industry Resistance to Intrusive Monitoring:</strong> Many legitimate customers consider physical counting “invasive and an operational hindrance.” This resistance creates pressure to minimize inspection frequency and thoroughness, potentially enabling evasion through timing manipulation.</p>\n\n<p><strong>Detection Reliability Problems:</strong> Empty server enclosures can be fitted with “cheap PCB replicas” that appear operational during visual inspection while containing no actual processing capability. Without sophisticated technical inspection equipment, physical counting may provide false confidence in compliance verification.</p>\n\n<h2 id=\"technical-evasion-capabilities-beyond-physical-smuggling\">Technical Evasion Capabilities: Beyond Physical Smuggling</h2>\n\n<h3 id=\"distributed-training-approaches\">Distributed Training Approaches</h3>\n\n<p>Recent research demonstrates viable approaches for training large models across globally distributed, smaller GPU clusters that appear as routine cloud usage rather than concentrated training operations.</p>\n\n<p><strong>Geographic Distribution:</strong> Google trained Gemini Ultra across multiple data centers using geographic distribution methods that major technology companies routinely employ. Similar approaches enable sophisticated actors to utilize distributed smuggled hardware while appearing to comply with concentration-based detection methods.</p>\n\n<p><strong>OpenDiLoCo Research:</strong> Academic research projects like OpenDiLoCo enable “training across poorly connected clusters by reducing synchronization frequency,” demonstrating practical approaches for utilizing smuggled hardware through distributed networks that evade traditional monitoring approaches.</p>\n\n<h3 id=\"advanced-obfuscation-techniques\">Advanced Obfuscation Techniques</h3>\n\n<p><strong>Power Signature Manipulation:</strong> Engineers have developed “power smoothing commands specifically designed to obscure training signatures,” making detection through power consumption analysis unreliable. Empirical measurements show AI training creates “instant fluctuations of power consumption across the datacenter on the order of tens of megawatts,” complicating steady-state detection approaches.</p>\n\n<p><strong>Traffic Pattern Obfuscation:</strong> Modern distributed training uses encrypted protocols that generate “elevated rates of false positives” in detection systems. Collective communication operations create irregular patterns difficult to distinguish from other high-bandwidth applications.</p>\n\n<h2 id=\"the-path-forward-technology-enabled-verification\">The Path Forward: Technology-Enabled Verification</h2>\n\n<h3 id=\"hardware-rooted-authentication\">Hardware-Rooted Authentication</h3>\n\n<p>Rather than relying solely on physical counting, robust export control enforcement requires hardware-level verification systems that cannot be circumvented through component substitution or geographic relocation.</p>\n\n<p><strong>Cryptographic Attestation:</strong> Modern AI accelerators incorporate Trusted Execution Environments (TEEs) capable of generating unforgeable location and usage attestations. These systems provide continuous verification rather than periodic inspection snapshots.</p>\n\n<p><strong>Real-Time Monitoring:</strong> Location verification systems can provide continuous, automated monitoring that supplements rather than replaces traditional enforcement approaches while addressing the resource constraints Director Kratsios correctly identified.</p>\n\n<h3 id=\"policy-integration-opportunities\">Policy Integration Opportunities</h3>\n\n<p>The Trump Administration’s emphasis on reducing regulatory burden while maintaining security creates opportunities for technology-enabled compliance that reduces both enforcement costs and industry operational impact.</p>\n\n<p><strong>Automated Compliance:</strong> Hardware-rooted verification systems can provide the “tools that BIS needs to do the enforcement activities” while reducing the invasive inspection requirements that concern legitimate customers.</p>\n\n<p><strong>Strategic Resource Allocation:</strong> By automating routine compliance verification, BIS resources can focus on sophisticated evasion attempts and strategic enforcement priorities rather than manual counting activities.</p>\n\n<h2 id=\"conclusion-bridging-policy-optimism-with-technical-realities\">Conclusion: Bridging Policy Optimism with Technical Realities</h2>\n\n<p>Characterizing AI chip tracking as a simple physical counting exercise underestimates both the technical sophistication of evasion methods and the portable nature of the hardware itself.</p>\n\n<p>The documented success of smuggling efforts, the reliance of Chinese AI development on illicit hardware, and the inherent limitations of manual inspection approaches suggest that effective export control enforcement requires technological solutions that complement traditional regulatory approaches.</p>\n\n<p>The Trump Administration’s AI Action Plan creates opportunities to deploy verification technologies that address these challenges while supporting the broader goal of American AI dominance. Rather than choosing between regulatory effectiveness and industry cooperation, technology-enabled approaches can enhance both enforcement capability and operational efficiency.</p>\n\n<p>The strategic imperative remains clear: ensuring that America’s AI leadership translates into sustained competitive advantage requires verification systems adequate to the technical sophistication of both the technology and those who seek to circumvent controls. Physical counting, while important, represents only the foundation of a comprehensive approach that must evolve alongside the threats it seeks to address.</p>\n\n<p>The challenge is not whether export controls matter—they clearly do—but whether enforcement approaches can keep pace with the technical realities of an increasingly sophisticated global technology landscape. <em>If America wants to lead in building the AI stack for the world, it must also lead in verifying that stack is protected.</em></p>\n"
  },
  {
    "title": "America First AI Policy in Action",
    "slug": "america-first-ai-policy-in-action",
    "date": "2025-07-15",
    "author": "Kristian Rönn",
    "tags": [
      "National Security",
      "AI Trade Policy",
      "AI Security",
      "Semiconductors"
    ],
    "image": "media/oole08QnB2huPcp75s2WqGn8uMQ.png",
    "description": "The Congressional roadmap for scaling American AI leadership globally—and the verification technologies needed to execute it",
    "content": "<h1 id=\"america-first-ai-policy-in-action\">America First AI Policy in Action</h1>\n\n<h2 id=\"how-technical-infrastructure-could-unlock-trillions-in-us-technology-exports\">How Technical Infrastructure Could Unlock Trillions in US Technology Exports</h2>\n\n<p>The $1.3 trillion Stargate deal sits at the intersection of two powerful forces shaping American AI policy. On one side, Congressional leaders are calling for stricter export controls—House Select Committee Chairman John Moolenaar’s <a href=\"https://selectcommitteeontheccp.house.gov/sites/evo-subsites/selectcommitteeontheccp.house.gov/files/evo-media-document/america-first-ai-policy_letter.pdf\">recent letter to Commerce Secretary Howard Lutnick</a> outlines eight specific requirements for limiting AI diffusion while maintaining security. On the other side, OpenAI’s launch of “OpenAI for Countries” signals the industry’s push for aggressive global expansion.</p>\n\n<p>These forces appear contradictory: more controls versus more diffusion. But technology creates a third path where both vectors align. The right verification infrastructure doesn’t just enable stricter controls—it enables more exports by providing the security assurance that makes large-scale partnerships possible. Instead of choosing between growth and security, hardware-governed compute makes both achievable simultaneously.</p>\n\n<h3 id=\"the-congressional-framework-eight-pillars-of-ai-export-policy\">The Congressional Framework: Eight Pillars of AI Export Policy</h3>\n\n<p>Chairman Moolenaar’s letter to Secretary Lutnick provides a detailed roadmap for America First AI policy, with specific technical requirements that could enable unprecedented export growth:</p>\n\n<p>The Stargate deal’s 500,000 advanced chips illustrate why existing export control systems face architectural limitations. A Business Development manager at a major OEM recently revealed: “In CEE alone, we have about 10,000 GPUs worth of projects locked because of export licenses. It kills projects as investors choose different markets where the likelihood of getting a positive response from the BIS (Bureau of Industry and Security) on a shorter turn-around time is higher.”</p>\n\n<p>Scale that to the Congressional vision of multiple trillion-dollar partnerships, and the bottleneck becomes clear.</p>\n\n<h4 id=\"policy-pillars-with-technical-solutions\">Policy Pillars with Technical Solutions</h4>\n\n<p>The Congressional framework maps directly to emerging verification technologies that could enable the scale of export growth envisioned.</p>\n\n<h4 id=\"the-scale-challenge-why-traditional-approaches-fall-short\">The Scale Challenge: Why Traditional Approaches Fall Short</h4>\n\n<p>Traditional export control approaches face an impossible tradeoff for large-scale AI partnerships: you can optimize for scale, speed, or security—but not all three simultaneously. The Congressional framework demands all three.</p>\n\n<p>The Congressional requirements suggest that hardware-based verification could be the only approach that delivers all three simultaneously.</p>\n\n<h3 id=\"the-implementation-challenge-scale-vs-speed-vs-security\">The Implementation Challenge: Scale vs. Speed vs. Security</h3>\n\n<h3 id=\"technical-solutions-for-policy-implementation\">Technical Solutions for Policy Implementation</h3>\n\n<h4 id=\"real-time-location-verification\">Real-Time Location Verification</h4>\n\n<p>The requirement for “city- or state-level location reporting” with automatic diversion notification points to delay-based location verification systems that measure speed-of-light travel times between chips and verification stations. This creates spoof-resistant location proof that GPS-based systems cannot match.</p>\n\n<h4 id=\"compute-infrastructure-visibility\">Compute Infrastructure Visibility</h4>\n\n<p>Monitoring the 49% overseas capacity limit and 10% single-partner training compute cap requires systems that can track Total Compute Power across jurisdictions in real-time. This involves converting chip deployments to computational capacity and maintaining running totals per partner nation, but also hinges heavily on the actual understanding of where the chips are.</p>\n\n<h4 id=\"workload-classification\">Workload Classification</h4>\n\n<p>Distinguishing training from inference to keep frontier model weights under US jurisdiction requires analyzing usage patterns—burst vs. constant loads, memory access patterns, and computational intensity signatures that indicate the type of AI workload being executed in a particular jurisdiction.</p>\n\n<h4 id=\"integrated-security-monitoring\">Integrated Security Monitoring</h4>\n\n<p>The requirement for tamper-evident monitoring suggests systems where security verification is embedded directly into the compute infrastructure rather than added as an overlay, providing continuous attestation of system integrity.</p>\n\n<h3 id=\"the-stargate-template-scaling-beyond-bilateral-deals\">The Stargate Template: Scaling Beyond Bilateral Deals</h3>\n\n<p>If successfully implemented, the Stargate partnership could create a replicable template for America First AI policy execution. The key insight is that verification technology doesn’t just enable individual deals—it creates the infrastructure for systematic scaling.</p>\n\n<p>Congressional leaders envision not just the UAE partnership, but a global ecosystem of AI partnerships that reinforce US technological leadership. Each successful deployment creates precedent for faster approval of subsequent deals.</p>\n\n<h4 id=\"economic-multiplier-effects\">Economic Multiplier Effects</h4>\n\n<p>The letter emphasizes that “higher-income partners, such as the UAE, will be able to invest dollar-for-dollar in U.S. infrastructure, furthering U.S. AI capability and capacity.” This creates a positive feedback loop where export success strengthens domestic AI development.</p>\n\n<h4 id=\"competitive-positioning\">Competitive Positioning</h4>\n\n<p>Early implementation of verification requirements could establish technical standards that become industry norms, extending US influence through infrastructure rather than just policy.</p>\n\n<h4 id=\"standards-setting\">Standards Setting</h4>\n\n<h3 id=\"the-openai-for-countries-precedent\">The OpenAI for Countries Precedent</h3>\n\n<p>OpenAI’s recent launch of “OpenAI for Countries” demonstrates the market demand for scaled international AI partnerships. The initiative suggests that leading AI companies are ready to expand globally, but need the regulatory framework and technical infrastructure to do so securely.</p>\n\n<p>The Congressional requirements provide the policy framework. Verification technology provides the technical infrastructure. The combination could unlock the trillions in export opportunities that Chairman Moolenaar envisions.</p>\n\n<h3 id=\"beyond-export-control-technology-as-policy-enabler\">Beyond Export Control: Technology as Policy Enabler</h3>\n\n<p>The Congressional framework suggests a fundamental shift in how export control technology is conceived. Rather than barriers to trade, verification systems become enablers of strategic partnerships that wouldn’t otherwise be possible.</p>\n\n<p>This approach transforms the value proposition for international partners. Instead of accepting intrusive oversight, they gain access to cutting-edge verification infrastructure that provides independent security assurance while preserving operational sovereignty. Moreover, the same underlying technology could maybe be leveraged to provide additional value, for example through data sovereignty capabilities—offering customers cryptographic proof of where their data is processed. This dual-purpose approach means verification infrastructure isn’t just a compliance cost, but a value-generating asset that creates new market opportunities.</p>\n\n<h3 id=\"conclusion-the-infrastructure-for-american-ai-leadership\">Conclusion: The Infrastructure for American AI Leadership</h3>\n\n<p>The Congressional framework for America First AI policy is ambitious but achievable—if the right technical infrastructure exists. The Stargate deal provides the first test case, but success requires thinking beyond individual partnerships to the systematic scaling of US AI exports.</p>\n\n<p>The technical requirements are clear: location verification, compute monitoring, workload classification, and integrated security systems. The policy framework exists. The market demand is evident through a plethora of delayed projects in sensitive regions or initiatives like OpenAI for Countries.</p>\n\n<p>What remains is execution. The organizations that can deliver verification technology at the scale the Congressional framework envisions will enable the next phase of American AI leadership—one where technological excellence and export growth reinforce each other rather than compete.</p>\n\n<p>The trillions in potential deals that Congressional leaders envision aren’t just economic opportunities—they’re the foundation for an AI ecosystem that extends American technological leadership globally. The verification infrastructure to make this vision reality is the next frontier in AI policy implementation.</p>\n"
  },
  {
    "title": "The $16.8 Billion Annual Cost of AI Chip Smuggling",
    "slug": "the-16-8-billion-annual-cost-of-ai-chip-smuggling",
    "date": "2025-06-12",
    "author": "Kristian Rönn",
    "tags": [
      "National Security",
      "AI Trade Policy",
      "Semiconductors",
      "AI Security"
    ],
    "image": "media/TEthdbacyS4UDO7PWYVxAsLXUlw.jpeg",
    "description": "How Illicit Semiconductor Trade is Draining American Innovation and What Technology Can Do About It",
    "content": "<h1 id=\"the-168-billion-annual-cost-of-ai-chip-smuggling\">The $16.8 Billion Annual Cost of AI Chip Smuggling</h1>\n\n<p>While policymakers debate the future of AI regulation, a silent economic hemorrhage is already underway. Advanced AI chips—the engines of artificial intelligence—are flowing out of American control at an alarming rate, carrying with them not just hardware, but the entire economic potential of the AI revolution. Analysis of current smuggling patterns suggests this illicit trade is draining approximately <strong>$16.8 billion annually</strong> in direct economic value from the United States¹’². But the true strategic cost may be far greater.</p>\n\n<h2 id=\"the-hidden-economic-drain\">The Hidden Economic Drain</h2>\n<p>The scale of AI chip smuggling defies easy comprehension. An upcoming report from the Center for New American Security (CNAS) estimates that <strong>100,000 export-controlled AI chips</strong> were smuggled into China in the past year alone, representing between 10-50% of China’s total AI model-training capacity³. These aren’t just components disappearing into a black market—they’re <strong>strategic assets</strong> being systematically diverted to fuel adversarial AI development.</p>\n\n<p>Consider the arithmetic of this theft. A single Nvidia H100 chip commands approximately <strong>$28,000</strong> on the legitimate market⁴. But investigative journalists have identified at least <strong>$800 million worth</strong> of smuggled AI chip shipments since the implementation of 2023 export controls⁵. Individual incidents, such as a $390 million Nvidia server heist in Malaysia, illustrate both the sophisticated methods and enormous values at stake⁶.</p>\n\n<p><em>As the CNAS report notes: “Tens to hundreds of thousands of high-performance AI chips are smuggled into China annually, representing a significant portion of its illicitly acquired AI model-training capacity.”³</em></p>\n\n<p>The smuggling networks themselves have evolved into sophisticated operations involving shell companies, intermediaries in third countries like Malaysia and Singapore, and even large-scale physical theft. A recent House Select Committee report found that the Chinese AI platform DeepSeek was “likely built using stolen U.S. technology” and relies on smuggled Nvidia chips, including A100s, H800s, and H100s⁷.</p>\n\n<h3 id=\"current-enforcement-a-57-million-response-to-a-multi-billion-dollar-problem\">Current Enforcement: A $57 Million Response to a Multi-Billion-Dollar Problem</h3>\n<p>The disparity between the scale of the challenge and available resources is stark. The Bureau of Industry and Security’s (BIS) enforcement budget was <strong>$57 million in FY2024</strong>⁵—a figure dwarfed by the hundreds of millions in smuggled chips identified by journalists alone. This resource gap reflects a broader challenge: traditional export controls, designed for an earlier era of technology competition, are proving inadequate against adaptive adversaries with strong economic incentives to circumvent them.</p>\n\n<p>Meanwhile, U.S. companies bear the compliance costs. Nvidia has reported an <strong>$8 billion revenue hit</strong> from unsellable inventory and licensing restrictions, plus a separate <strong>$5.5 billion charge</strong> tied to controls on chip sales to China⁸. When export controls are easily bypassed through smuggling, these compliance costs become a “tax” that fails to achieve its strategic objective.</p>\n\n<h2 id=\"beyond-hardware-the-strategic-value-at-stake\">Beyond Hardware: The Strategic Value at Stake</h2>\n<p>Understanding the true cost of AI chip smuggling requires looking beyond the hardware’s sticker price to its role as an <strong>economic multiplier</strong>. According to Nvidia’s own projections, companies can achieve a return of <strong>$5 to $7 for every dollar invested</strong> in AI chips over a four-year operational period⁹. This isn’t just marketing hyperbole—it reflects the fundamental reality that AI chips are the primary capital equipment in what industry observers call “AI factories.”</p>\n\n<h3 id=\"the-openai-economy-where-hardware-drives-trillion-dollar-valuations\">The OpenAI Economy: Where Hardware Drives Trillion-Dollar Valuations</h3>\n<p>Consider OpenAI’s trajectory. Valued at an estimated <strong>$300 billion</strong> with <strong>$4 billion in revenue</strong> for 2024¹⁰, the company plans to have <strong>64,000 Nvidia Blackwell chips</strong> operational by the end of 2026—representing roughly <strong>$3.84 billion in chip investments</strong> alone. OpenAI’s projected compute spending with Microsoft for 2025 is <strong>$13 billion</strong>¹⁰, underscoring how AI chip access directly translates to economic power.</p>\n\n<p>CoreWeave, the AI-chip-native cloud provider, tells a similar story. Recently targeting an IPO valuation of <strong>$35 billion</strong> on revenues of <strong>$1.9 billion</strong>¹¹, the company’s entire business model is built upon access to Nvidia’s H100s, A100s, and GH200s. Its <strong>$7.9 billion in debt</strong> and <strong>$15.1 billion in Remaining Performance Obligations</strong>¹¹ reflect the capital-intensive nature of AI infrastructure—and the enormous value it generates.</p>\n\n<p><em>“Each AI chip retained within allied economies represents a ‘seat’ in the innovation theater of the AI revolution.”</em></p>\n\n<h3 id=\"the-innovation-multiplier-effect\">The Innovation Multiplier Effect</h3>\n<p>The broader AI market validates this hardware-driven value creation. The market for generative AI chips alone was worth over <strong>$125 billion in 2024</strong>—representing more than 20% of total chip sales¹². AMD’s CEO Lisa Su projects the total addressable market for AI accelerator chips to reach <strong>$500 billion by 2028</strong>¹², larger than the sales for the entire chip industry in 2023.</p>\n\n<p>But the economic impact extends far beyond chip sales. Goldman Sachs projects that AI could increase global GDP by <strong>$7 trillion over the next decade</strong>¹³. McKinsey estimates <strong>$17.1 to $25.6 trillion</strong> in annual value from AI¹³. These projections aren’t just about software—they’re fundamentally dependent on access to the underlying hardware that makes AI possible.</p>\n\n<p>When advanced AI chips are smuggled away from allied economies, they take this economic potential with them. The <strong>$16.8 billion annual drain</strong> represents not just lost hardware, but a diminished capacity for AI-driven research, development, and deployment within the United States and allied nations—economic value that instead flows to strategic competitors.</p>\n\n<h2 id=\"the-compounding-cost-of-inaction\">The Compounding Cost of Inaction</h2>\n<p>The <strong>$16.8 billion in annual economic value</strong> currently being diverted through AI chip smuggling represents just the direct, measurable impact. But this figure understates the true strategic cost, which compounds over time through several mechanisms:</p>\n\n<h3 id=\"accelerated-adversarial-capabilities\">Accelerated Adversarial Capabilities</h3>\n<p>China has demonstrated a decades-long strategy of leveraging technology transfer—both legitimate and illicit—to advance its economic and military capabilities. Economic espionage and intellectual property theft, largely attributed to China, already cost the U.S. economy an estimated <strong>$300-600 billion annually</strong>¹⁴. Smuggled AI chips become force multipliers for these activities, potentially enhancing capabilities for cyber espionage, surveillance systems, and military AI development.</p>\n\n<p>The recent revelation that DeepSeek was built using smuggled U.S. chips illustrates this dynamic perfectly. When DeepSeek announced its capabilities, U.S. technology stocks experienced a <strong>$1 trillion decrease in value</strong>¹⁵, demonstrating how adversarial AI development—enabled by smuggled U.S. hardware—can directly impact American economic interests.</p>\n\n<h3 id=\"erosion-of-innovation-ecosystem-advantages\">Erosion of Innovation Ecosystem Advantages</h3>\n<p>The United States currently maintains what experts call the “most defensible advantage” in AI: total compute capacity. This advantage creates a virtuous cycle—greater compute enables more experimentation, faster model development, wider AI deployment, and consequently more data to fuel even better models.</p>\n\n<p><em>“The true metric of AI leadership lies not just in developing advanced models but in the ability to deploy and integrate AI systems at scale across the economy.”</em></p>\n\n<p>Each smuggled chip disrupts this virtuous cycle for the U.S. while potentially accelerating it for competitors. The cumulative effect threatens America’s position in what many consider the most economically transformative technology in history.</p>\n\n<h3 id=\"national-security-and-economic-convergence\">National Security and Economic Convergence</h3>\n<p>The national security implications carry their own economic costs. Advanced AI systems have been explicitly recognized as potential existential threats by AI lab CEOs, Nobel laureates, and leading researchers. Current AI models can already assist in engineering dangerous pathogens, while advanced computing clusters could enable adversaries to enhance military applications, support sophisticated cyber operations, and assist in mass surveillance systems.</p>\n\n<p>The military applications alone justify concern. Lawmakers have warned that smuggled chips could help the Chinese Communist Party design advanced weaponry or accelerate work on Artificial General Intelligence. The urgency has been compared to controlling nuclear technology—and for good reason.</p>\n\n<h2 id=\"a-technology-enabled-path-forward\">A Technology-Enabled Path Forward</h2>\n<p>The challenge of AI chip smuggling cannot be solved through traditional export controls alone. The adaptive nature of smuggling networks, combined with the enormous economic incentives involved, demands a technological response that matches the sophistication of the threat.</p>\n\n<h3 id=\"hardware-based-location-verification\">Hardware-Based Location Verification</h3>\n<p>The solution lies in making smuggling economically unfeasible through <strong>technology-enabled verification systems</strong>. The bipartisan Chip Security Act, recently introduced in Congress, envisions exactly this approach: requiring location verification mechanisms on export-controlled chips, mandating reporting of diversions, and establishing rules to prevent unauthorized use¹⁶.</p>\n\n<p>Advanced location verification technologies, such as <strong>delay-based verification systems</strong>, offer promising countermeasures¹⁷. These systems use chips to communicate with networks of “landmark” servers, determining location based on signal travel time—a method far more secure against spoofing than GPS and functional even within data centers where GPS signals struggle to penetrate.</p>\n\n<p>Companies like Google are already using similar technologies to track their in-house AI chips¹⁷. The concept scales naturally: as the verification infrastructure expands, it becomes increasingly difficult and expensive for smugglers to operate undetected.</p>\n\n<h3 id=\"the-path-to-prevention\">The Path to Prevention</h3>\n<p>Conservative projections suggest that robust tracking technologies, combined with enhanced enforcement, could dramatically reduce this <strong>$16.8 billion annual economic drain</strong> when widely implemented with effective international cooperation. While determined adversaries will inevitably attempt circumvention, the key is raising the cost and complexity of smuggling operations while improving detection capabilities.</p>\n\n<p>This technological approach offers several advantages over traditional controls:</p>\n\n<ul>\n  <li>\n    <p><strong>Continuous Verification</strong>: Unlike periodic audits, technology-enabled systems provide ongoing location confirmation</p>\n  </li>\n  <li>\n    <p><strong>Scalable Implementation</strong>: Software-based solutions can be deployed across thousands of chips simultaneously</p>\n  </li>\n  <li>\n    <p><strong>Economic Efficiency</strong>: Automated verification reduces the human resources required for monitoring</p>\n  </li>\n  <li>\n    <p><strong>Deterrent Effect</strong>: Known tracking capabilities discourage smuggling attempts</p>\n  </li>\n</ul>\n\n<h3 id=\"international-cooperation-and-industry-partnership\">International Cooperation and Industry Partnership</h3>\n<p>Success requires coordination across multiple dimensions. Allied nations must implement complementary verification requirements, closing the jurisdictional arbitrage that smugglers currently exploit. Industry partnership is equally critical—chip manufacturers, cloud providers, and system integrators all play roles in the broader ecosystem that enables or prevents smuggling.</p>\n\n<p>The development of verification technologies also represents an economic opportunity for U.S. firms. Creating robust, tamper-resistant tracking systems requires expertise in cryptography, secure hardware design, and distributed systems—areas where American companies maintain technological leads.</p>\n\n<h2 id=\"securing-americas-ai-future\">Securing America’s AI Future</h2>\n<p>The $16.8 billion annual economic drain from AI chip smuggling represents just the visible portion of a much larger strategic challenge. As artificial intelligence reshapes the global economy, control over AI hardware translates directly into economic and security advantages. The United States cannot afford to allow these critical assets to flow uncontrolled to strategic competitors.</p>\n\n<p>The window for effective action is narrowing. As China’s indigenous semiconductor capabilities advance and AI systems become more powerful, the strategic importance of maintaining control over U.S. technology will only increase. The companies and nations that control advanced AI capabilities will shape the economic and security landscape for decades to come.</p>\n\n<p><em>“By implementing robust location verification systems today, we can ensure that American technological leadership translates into lasting economic and strategic advantages.”</em></p>\n\n<p>Technology-enabled solutions offer a path forward that balances economic openness with security imperatives. By making smuggling prohibitively difficult and expensive, verification systems can help ensure that the benefits of American AI innovation flow primarily to American companies, workers, and allies—rather than subsidizing adversarial capabilities development.</p>\n\n<p>The choice is clear: invest in sophisticated countermeasures now, or continue subsidizing competitors with America’s most valuable technology. The economic and security stakes of this decision will compound for years to come, making today’s policy choices among the most consequential of the AI era.</p>\n\n<h2 id=\"references\">References</h2>\n<p>¹ Analysis based on CNAS smuggling estimates (100,000 chips annually) and Nvidia ROI projections ($168,000 lifetime economic value per chip)</p>\n\n<p>² Calculated as: 100,000 smuggled chips × $168,000 average lifetime economic value = $16.8B annual economic transfer</p>\n\n<p>³ “AI Diffusion Framework” - Center for New American Security (CNAS), 2025</p>\n\n<p>⁴ “NVIDIA H100 80GB AI-chip” - ASA Computers and market analysis</p>\n\n<p>⁵ “Memo - AI Diffusion” - Center for New American Security, 2025</p>\n\n<p>⁶ “NVIDIA’s Crossroads: Navigating Geopolitical Storms” - AInvest, 2025</p>\n\n<p>⁷ House Select Committee on Strategic Competition between the United States and the Chinese Communist Party, 2025</p>\n\n<p>⁸ “Nvidia’s AI Chip Dilemma: Navigating U.S. Regulations and Smuggling Risks in China” - AInvest, 2025</p>\n\n<p>⁹ “Nvidia Economics: Make $5-$7 for Every $1 Spent on AI-chips” - HPCwire, 2024</p>\n\n<p>¹⁰ “OpenAI Is A Systemic Risk To The Tech Industry” - Where’s Your Ed At, 2025</p>\n\n<p>¹¹ “CoreWeave’s IPO: A House of Cards Built on AI-chips and Microsoft?” - AInvest, 2025</p>\n\n<p>¹² “2025 global semiconductor industry outlook” - Deloitte, 2025</p>\n\n<p>¹³ “A new look at the economics of AI” - MIT Sloan, 2025</p>\n\n<p>¹⁴ “China’s Technology Transfer Strategy” - Kansas State University; “China’s Brute Force Economics” - TNSR, 2022</p>\n\n<p>¹⁵ Various financial news sources reporting on DeepSeek market impact, January 2025</p>\n\n<p>¹⁶ “Chairman Moolenaar, Bipartisan Lawmakers Unveil Bill to Stop AI Chip Smuggling to China” - House Select Committee, 2025</p>\n\n<p>¹⁷ “Can ‘Location Verification’ Stop AI Chip Smuggling?” - AI Frontiers, 2025</p>\n"
  },
  {
    "title": "Ping-Based Location Verification: 3 Deployment Scenarios",
    "slug": "ping-based-location-verification-3-deployment-scenarios",
    "date": "2025-05-30",
    "author": "Kristian Rönn",
    "tags": [
      "AI Security",
      "Location Verification",
      "National Security"
    ],
    "image": "media/srv05vGqYGqH4olrQbiwjvybjw.png",
    "description": "Countering 'Dark Compute' and Illicit Proliferation: A Review of AI Chip Location Verification Methods.",
    "content": "<h1 id=\"ping-based-location-verification-3-deployment-scenarios\">Ping-Based Location Verification: 3 Deployment Scenarios</h1>\n\n<h2 id=\"introduction-the-critical-need-for-technology-enabled-location-verification\">Introduction: The Critical Need for Technology Enabled Location Verification</h2>\n\n<p>In today’s rapidly evolving artificial intelligence landscape, verifying the physical location of high-performance computing hardware has become a paramount national security concern. Advanced AI chips, particularly those manufactured by industry leaders like Nvidia and AMD, have become highly sought-after components for nations looking to accelerate their AI capabilities. The illegal smuggling of these chips through shell companies and intermediary jurisdictions threatens to undermine export controls designed to protect national interests and global security.</p>\n\n<p>The concept of “dark compute” - unmonitored computational resources that could enable malicious actors to develop dangerous capabilities - represents a significant threat to national security. Just as the international community monitors the proliferation of enriched uranium to prevent nuclear weapons development, there is an urgent need to implement robust technology-enabled verification systems for advanced computing hardware.</p>\n\n<p>Current export control regulations require end-user checks to verify compliance with licenses. It is untenable to imagine that humans can adequately and accurately account for every exported AI chip.</p>\n\n<h2 id=\"the-current-threat-landscape\">The Current Threat Landscape</h2>\n\n<p>Recent intelligence indicates that hundreds of thousands of advanced AI chips are being illegally smuggled into restricted jurisdictions through elaborate networks of shell companies operating in countries like Malaysia and Singapore. These chips then power AI development that circumvents international safeguards and regulations. For example, reports suggest that the Chinese DeepSeek model was trained using tens of thousands of illegally imported Nvidia AI chips.</p>\n\n<p>This circumvention has far-reaching consequences beyond direct security threats. When DeepSeek announced its capabilities, U.S. technology stocks reportedly experienced a $1 trillion decrease in value, demonstrating the economic impact of unauthorized AI development. Current regulations include a License Exception for Low-Power Performance (LPP), which exempts orders below the equivalent of 1,700 Nvidia H100 chips from certain controls. This creates a significant loophole that adversaries could exploit by establishing multiple shell companies to import chips below this threshold before aggregating them for large-scale AI supercomputing.</p>\n\n<p>To address these critical challenges, three primary approaches to location verification have emerged. Each offers distinct advantages and limitations that make them suitable for different deployment scenarios.</p>\n\n<h2 id=\"1-co-located-approach-maximum-security-for-high-risk-environments\">1. Co-located Approach: Maximum Security for High-Risk Environments</h2>\n\n<p><img src=\"/media/NoiCf8zvTbRHtTACDNuH7nmL6k.svg\" alt=\"Co-located Approach Diagram\" /></p>\n\n<h3 id=\"detailed-implementation\">Detailed Implementation</h3>\n\n<p>The co-located approach establishes a secure verification system within the physical confines of the datacenter itself. This system consists of three primary components:</p>\n\n<ol>\n  <li>\n    <p><strong>Attestation Agent</strong>: Embedded within the Trusted Execution Environment (TEE) of each AI chip, this agent securely communicates with the endorser server without the possibility of tampering.</p>\n  </li>\n  <li>\n    <p><strong>Endorser Server</strong>: A third-party controlled server housed within the datacenter’s Local Area Network (LAN). This server is contained in a tamper-proof enclosure with specialized security features such as motion sensors, tamper-evident seals, and continuous monitoring systems.</p>\n  </li>\n</ol>\n\n<p>The communication between these components occurs entirely within the datacenter’s network, with the endorser server periodically sending cryptographically signed attestation reports during physical audits.</p>\n\n<h3 id=\"advantages-vs-limitations\">Advantages vs Limitations</h3>\n\n<p><strong>Advantages:</strong></p>\n<ul>\n  <li>✓ <strong>Airgapped Compatibility</strong>: Uniquely suited for Security Level 5 (SL5) datacenters that operate in complete isolation from external networks, essential for facilities handling classified information.</li>\n  <li>✓ <strong>Precise Location Verification</strong>: With near-instantaneous communication between chips and the verification system, location can be verified down to specific rack or server level, making spoofing virtually impossible.</li>\n  <li>✓ <strong>Sensor Integration</strong>: Enables connection to datacenter-specific sensors monitoring power usage, cooling systems, network interfaces, and hardware performance counters, creating a robust profile of legitimate activity.</li>\n  <li>✓ <strong>Enforcement Mechanisms</strong>: Enables graduated response including processing throttling, workload isolation, emergency power termination, and even cooling system deactivation for severe violations.</li>\n</ul>\n\n<p><strong>Limitations:</strong></p>\n<ul>\n  <li>X <strong>Vulnerability to Physical Tampering</strong>: Despite tamper-proof enclosures, the endorser server remains physically accessible to datacenter personnel, creating potential attack vectors including electromagnetic analysis, side-channel attacks, and counterfeit hardware replacement.</li>\n  <li>X <strong>Audit Complexity and Cost</strong>: Auditors must conduct regular physical inspections. Their duties include securely downloading attestation records to a portable drive for off-site analysis and verifying that the endorser server has not been tampered with.</li>\n  <li>X <strong>Single Point of Failure Risk</strong>: If the endorser server is compromised or malfunctions, the entire verification system for that facility could be affected.</li>\n</ul>\n\n<h3 id=\"ideal-use-cases\">Ideal Use Cases</h3>\n\n<p>The co-located approach is best suited for:</p>\n\n<ul>\n  <li>Military and intelligence agency facilities developing AI for national security applications</li>\n  <li>Critical infrastructure protected by national security laws</li>\n  <li>Research facilities working on cutting-edge AI capabilities with dual-use potential</li>\n  <li>Government-operated supercomputing centers with strict security requirements</li>\n</ul>\n\n<h2 id=\"2-network-approach-cost-effective-solution-for-lower-risk-scenarios\">2. Network Approach: Cost-Effective Solution for Lower-Risk Scenarios</h2>\n\n<p><img src=\"/media/Sl5ipLHbP3A834JT2as8dX2hs.svg\" alt=\"Network Approach Diagram\" /></p>\n\n<h3 id=\"detailed-implementation-1\">Detailed Implementation</h3>\n\n<p>The network approach leverages a distributed network of landmark servers operated by trusted third parties. This implementation includes:</p>\n\n<ol>\n  <li>\n    <p><strong>Attestation Agent</strong>: Similar to the co-located approach, this component resides within the TEE of each AI chip.</p>\n  </li>\n  <li>\n    <p><strong>Landmark Server Network</strong>: A geographically distributed network of trusted servers that communicate with the attestation agents. These landmarks can include servers in secure facilities like embassies, telecommunications hubs, certified datacenters, and government installations.</p>\n  </li>\n</ol>\n\n<p>The verification process triangulates the chip’s location by measuring network latency to multiple landmark servers, creating a unique network “fingerprint” that is difficult to falsify.</p>\n\n<h3 id=\"advantages-vs-limitations-1\">Advantages vs Limitations</h3>\n\n<p><strong>Advantages:</strong></p>\n<ul>\n  <li>✓ <strong>Economic Efficiency</strong>: Eliminates the need for additional hardware at each datacenter, reducing implementation costs, maintenance expenses, and administrative overhead.</li>\n  <li>✓ <strong>Minimal Operational Impact</strong>: Simple software deployment to existing systems with no modifications to datacenter infrastructure and reduced compliance burden for legitimate operators.</li>\n</ul>\n\n<p><strong>Limitations:</strong></p>\n<ul>\n  <li>X <strong>Location Accuracy Constraints</strong>: Network routing complexities, congestion, and inherent limitations in distance measurement make precise location verification challenging, especially within 500km of restricted jurisdictions.</li>\n  <li>X <strong>Incompatible with Airgapped Environments</strong>: Cannot function in high-security facilities that operate without external network connections.</li>\n  <li>X <strong>Limited Enforcement Options</strong>: Restricted to software-level controls without direct access to hardware systems, reducing response capabilities for serious violations.</li>\n</ul>\n\n<h3 id=\"ideal-use-cases-1\">Ideal Use Cases</h3>\n\n<p>The network approach is best suited for:</p>\n\n<ul>\n  <li>Small-scale deployments with only a handful of AI-chips.</li>\n  <li>Cloud service providers offering AI acceleration to vetted customers</li>\n  <li>Academic and research institutions in low-risk jurisdictions</li>\n  <li>Commercial AI deployments with lower security requirements</li>\n  <li>Geographically isolated facilities far from restricted territories</li>\n</ul>\n\n<h2 id=\"3-hybrid-approach-balanced-security-for-most-enterprise-scenarios\">3. Hybrid Approach: Balanced Security for Most Enterprise Scenarios</h2>\n\n<p><img src=\"/media/7XJp5rlIJkKu3ImNbBFFpDXqEc.svg\" alt=\"Hybrid Approach Diagram\" /></p>\n\n<h3 id=\"detailed-implementation-2\">Detailed Implementation</h3>\n\n<p>The hybrid approach combines the strengths of both previous methods, creating a robust verification system that balances security and practicality:</p>\n\n<ol>\n  <li>\n    <p><strong>Attestation Agent</strong>: Similar to the co-located and network approach, this component resides within the TEE of each AI chip.</p>\n  </li>\n  <li>\n    <p><strong>Co-located Endorser</strong>: A tamper-resistant server installed within the datacenter’s LAN, similar to the co-located approach.</p>\n  </li>\n  <li>\n    <p><strong>Landmark Server Network</strong>: Unlike the co-located approach, which requires frequent physical inspections to ensure the endorser hasn’t been tampered with, this hybrid deployment scenario allows the endorser server to communicate with a broader network of landmark servers and other data center endorsers. This creates multiple layers of verification, ultimately requiring fewer physical inspections.</p>\n  </li>\n</ol>\n\n<p>This approach implements a trust chain where the co-located endorser verifies the AI chips, while the network of landmarks continuously verifies the endorser itself.</p>\n\n<h3 id=\"advantages-vs-limitations-2\">Advantages vs Limitations</h3>\n\n<p><strong>Advantages:</strong></p>\n<ul>\n  <li>✓ <strong>Multilayered Security Architecture</strong>: Implements defense-in-depth with local verification for precise location confirmation and network verification to ensure the endorser itself hasn’t been compromised.</li>\n  <li>✓ <strong>Reduced Audit Frequency</strong>: Continuous remote attestation supplements in-person inspections, with automated anomaly detection triggering targeted audits only when necessary.</li>\n  <li>✓ <strong>Operational Flexibility</strong>: Adaptable to different security requirements with configurable trust levels, graceful degradation during connectivity issues, and adjustable verification frequency.</li>\n  <li>✓ <strong>Enhanced Forensic Capabilities</strong>: Creates comprehensive audit trails with correlation between local and network data, historical pattern analysis, and evidence preservation for potential legal proceedings.</li>\n</ul>\n\n<p><strong>Limitations:</strong></p>\n<ul>\n  <li>X <strong>Not completely airgapped</strong>: Unlike the pure co-located solution, a hybrid approach can’t be completely airgapped, which means that it might not be suitable for military-grade security.</li>\n  <li>X <strong>Moderate Cost Increase</strong>: While less expensive than frequent physical audits, still requires initial hardware investment, ongoing maintenance, and security systems to protect the co-located endorser.</li>\n</ul>\n\n<h3 id=\"ideal-use-cases-2\">Ideal Use Cases</h3>\n\n<p>The hybrid approach is optimal for:</p>\n\n<ul>\n  <li>Enterprise AI deployments with significant security requirements</li>\n  <li>Datacenters in jurisdictions where export controls are a concern</li>\n  <li>Facilities with intermittent network connectivity</li>\n  <li>Systems processing sensitive but not classified information</li>\n  <li>Commercial entities working with government contracts</li>\n</ul>\n\n<h2 id=\"comparative-metrics\">Comparative Metrics</h2>\n\n<table>\n  <thead>\n    <tr>\n      <th>Metric</th>\n      <th>Co-located Approach</th>\n      <th>Network Approach</th>\n      <th>Hybrid Approach</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>Implementation Cost</strong></td>\n      <td>High (hardware + audits)</td>\n      <td>Low (software only)</td>\n      <td>Moderate (hardware + reduced audits)</td>\n    </tr>\n    <tr>\n      <td><strong>Location Accuracy</strong></td>\n      <td>Extremely high (facility-specific)</td>\n      <td>Moderate (regional)</td>\n      <td>High (facility-specific)</td>\n    </tr>\n    <tr>\n      <td><strong>Security Level</strong></td>\n      <td>Maximum</td>\n      <td>Basic</td>\n      <td>Enhanced</td>\n    </tr>\n    <tr>\n      <td><strong>Audit Requirements</strong></td>\n      <td>Frequent physical audits</td>\n      <td>Minimal to none</td>\n      <td>Occasional physical audits</td>\n    </tr>\n    <tr>\n      <td><strong>Network Dependency</strong></td>\n      <td>None (works in airgapped environments)</td>\n      <td>High (requires reliable internet)</td>\n      <td>Moderate (can function with intermittent connectivity)</td>\n    </tr>\n    <tr>\n      <td><strong>Tamper Resistance</strong></td>\n      <td>High (physical enclosure)</td>\n      <td>Limited (software-based)</td>\n      <td>Enhanced (physical + network verification)</td>\n    </tr>\n    <tr>\n      <td><strong>Enforcement Capabilities</strong></td>\n      <td>Comprehensive (hardware-level)</td>\n      <td>Limited (software-level)</td>\n      <td>Substantial (hardware + software)</td>\n    </tr>\n    <tr>\n      <td><strong>Sensor Integration</strong></td>\n      <td>Extensive</td>\n      <td>None</td>\n      <td>Moderate to extensive</td>\n    </tr>\n    <tr>\n      <td><strong>Scalability</strong></td>\n      <td>Limited by physical installation</td>\n      <td>Highly scalable</td>\n      <td>Moderately scalable</td>\n    </tr>\n    <tr>\n      <td><strong>Operational Impact</strong></td>\n      <td>Moderate</td>\n      <td>Minimal</td>\n      <td>Low to moderate</td>\n    </tr>\n    <tr>\n      <td><strong>Border Proximity Suitability</strong></td>\n      <td>Excellent</td>\n      <td>Poor within 500km of borders</td>\n      <td>Good</td>\n    </tr>\n    <tr>\n      <td><strong>Recommended Deployment Size</strong></td>\n      <td>Large facilities (1000+ chips)</td>\n      <td>Small deployments (&lt;500 chips)</td>\n      <td>Medium to large deployments (500+ chips)</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>The proliferation of advanced AI chips to unauthorized entities represents a significant national security challenge comparable to the spread of nuclear technology. Implementing robust location verification systems is an essential component of a comprehensive strategy to prevent “dark compute” from enabling dangerous capabilities in the hands of malicious actors.</p>\n\n<p>Each of the three approaches offers distinct advantages that make them suitable for different deployment scenarios based on security requirements, budget constraints, and operational considerations. The co-located approach provides maximum security for critical facilities, the network approach offers cost-effective verification for lower-risk deployments, and the hybrid approach strikes an optimal balance for most enterprise scenarios.</p>\n\n<p>As AI capabilities continue to advance, the importance of these verification systems will only increase. By implementing appropriate location verification based on risk assessment, organizations can help ensure that advanced computing resources remain in responsible hands while maintaining compliance with evolving regulatory frameworks.</p>\n"
  },
  {
    "title": "Security Guarantees in an America First AI Trade Policy",
    "slug": "security-guarantees-in-an-america-first-ai-trade-policy",
    "date": "2025-05-21",
    "author": "Kristian Rönn",
    "tags": [
      "National Security"
    ],
    "image": "media/9TLw1bo4Wr6uKJLQz8lRX6bp8.jpeg",
    "description": "Balancing bilateral dealmaking, semiconductor competitiveness, and national security in the age of artificial intelligence.",
    "content": "<h2 id=\"four-essential-properties-of-an-america-first-ai-trade-policy\">Four Essential Properties of an America First AI Trade Policy</h2>\n\n<p>From the Administration’s perspective, an effective America First approach to AI trade policy should accomplish four critical objectives:</p>\n\n<ol>\n  <li>Enable bilateral dealmaking leveraging America’s AI chip advantage</li>\n  <li>Ensure global competitiveness of U.S. semiconductor manufacturers</li>\n  <li>Maintain the hardware edge for U.S.-based AI companies</li>\n  <li>Prevent adversarial use of U.S. technology in weapons development and other security threats</li>\n</ol>\n\n<p>These properties represent the foundation of a trade policy that is supposed to put American interests first—but balancing them requires sophisticated policy mechanisms. Let’s examine each in detail.</p>\n\n<h3 id=\"1-enabling-bilateral-dealmaking-through-ai-chip-access\">1. Enabling Bilateral Dealmaking Through AI Chip Access</h3>\n\n<p>AI is becoming the most economically powerful technology in history. Within this administration, we’ll likely see artificial general intelligence emerge. This could lead to a world where AI systems running on specialized chips handle nearly all important economic work. The administration has a unique opportunity: controlling who gets access to U.S.-made AI chips can become one of its strongest tools in global trade negotiations.</p>\n\n<p>This advantage provides a basis for strategic cooperation, allowing the United States to engage in bilateral discussions that foster mutual economic growth and innovation across diverse sectors—from manufacturing to agriculture to services. By collaboratively managing access to these critical components, the administration can facilitate tailored agreements that benefit both American economic interests and the economic development of its partners.</p>\n\n<h3 id=\"2-ensuring-us-semiconductor-global-competitiveness\">2. Ensuring U.S. Semiconductor Global Competitiveness</h3>\n\n<p>Selling U.S.-developed and manufactured AI chips globally is essential for addressing trade imbalances and maintaining American dominance in semiconductor technology. The Trump administration’s AI datacenter deals with the UAE and Saudi Arabia, worth billions of dollars, demonstrate how chip exports can significantly improve America’s trade position.</p>\n\n<p>American semiconductor giants like NVIDIA and AMD must maintain their global market position to ensure continued leadership in chip design and manufacturing. Restricting their ability to sell internationally would not only harm these companies financially but could ultimately diminish American innovation capabilities as competitors grow stronger.</p>\n\n<h3 id=\"3-maintaining-the-hardware-edge-for-us-ai-companies\">3. Maintaining the Hardware Edge for U.S. AI Companies</h3>\n\n<p>However, to ensure the sustained leadership of American AI companies, it is crucial to manage the scale of access to advanced AI chips by foreign entities. This approach helps preserve the substantial advantages these U.S. firms currently hold in AI capabilities, revenue generation, and capital raised, which are largely due to their preferential access to cutting-edge AI hardware.</p>\n\n<p>This hardware edge has been acknowledged not only by the CEOs of leading American AI companies but also by their international counterparts. The founder of Chinese AI company DeepSeek has publicly recognized that limited access to advanced computing resources has significantly hampered their ability to compete with U.S. firms.</p>\n\n<h3 id=\"4-preventing-adversarial-misuse-of-us-technology\">4. Preventing Adversarial Misuse of U.S. Technology</h3>\n\n<p>Capable AI systems are recognized as a potential existential threat by the CEOs of all major AI labs, Nobel laureates, and the godfathers of modern AI. For this reason, it is critical that powerful AI capabilities don’t fall into the hands of terrorists, dictatorial regimes, and U.S. adversaries.</p>\n\n<p>While AI offers enormous economic and social benefits, advanced models and large computing clusters could enable adversaries and malicious actors to enhance military and intelligence applications, lower barriers to developing weapons of mass destruction, support sophisticated cyber operations, and assist in human rights violations such as mass surveillance.</p>\n\n<h2 id=\"navigating-competing-priorities-through-technology\">Navigating Competing Priorities Through Technology</h2>\n\n<p>A fundamental tension exists between the first two properties (enabling bilateral dealmaking and ensuring semiconductor competitiveness) and the latter two (maintaining a U.S. AI hardware edge and preventing misuse). If universal access to U.S. AI semiconductors is provided, it risks eliminating the advantage enjoyed by American AI companies and lose control over potential misuse by adversaries.</p>\n\n<p>The solution lies in implementing a proportional access framework: granting access to U.S. AI semiconductors based on the verifiable security guarantees that importers can provide. This approach allows the administration to finely calibrate its trade strategy, rewarding trusted partners while limiting access for less reliable actors.</p>\n\n<h3 id=\"1-access-proportional-to-security-guarantees\">1. Access Proportional to Security Guarantees</h3>\n\n<p>The current regulatory framework for critical technologies employs tiered control levels based on destination, end-user, and item sensitivity. While this differentiated approach is appropriate, the allocation of access should be explicitly tied to the strength of verifiable, hardware-based security guarantees provided by the recipient.</p>\n\n<p>This framework translates into crucial questions across the AI lifecycle:</p>\n\n<ul>\n  <li><strong>AI Inputs</strong>: “Where are the AI chips and other critical inputs located, and are global export controls being rigorously followed?”</li>\n  <li><strong>AI Training</strong>: “Is a trained model undergoing and passing specific safety evaluations before deployment, with auditable and tamper-resistant records?”</li>\n  <li><strong>AI Deployment</strong>: “Is the data of AI outputs and prompt logs being end-to-end encrypted, and in what jurisdiction is it stored, with assurances against unauthorized access?”</li>\n</ul>\n\n<h3 id=\"2-development-of-technical-standards\">2. Development of Technical Standards</h3>\n\n<p>Collaboration between the Bureau of Industry and Security (BIS), the National Institute of Standards and Technology (NIST), and U.S. industry is needed to develop comprehensive technical standards and reference architectures for crucial security protections. Standardizing requirements for tiered access will clarify expectations and accelerate the development of compliant solutions.</p>\n\n<h3 id=\"3-independent-third-party-auditing\">3. Independent Third-Party Auditing</h3>\n\n<p>Compliance with security standards must be verified through mandatory audits conducted by independent third parties. These auditors must be distinct from both U.S. exporters and foreign importers/end-users to ensure impartiality, similar to auditing practices in the financial sector.</p>\n\n<h3 id=\"4-funding-and-competitiveness\">4. Funding and Competitiveness</h3>\n\n<p>The costs associated with implementing and auditing these crucial security guarantees will primarily be a responsibility of the foreign importers, reflecting their benefit from accessing advanced U.S. technology. Furthermore, the development of innovative hardware and software solutions required for compliance should foster growth among U.S. technology firms.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>By implementing a system of proportional access based on verifiable security guarantees, the administration can balance competing priorities: enabling beneficial bilateral trade, maintaining U.S. semiconductor industry competitiveness, preserving the hardware edge for American AI companies, and preventing adversarial misuse of powerful technologies.</p>\n\n<p>This balanced approach ensures that America’s technological leadership translates into economic and strategic advantages while safeguarding national security. As AI continues its rapid development toward artificial general intelligence, the policies established today will determine whether the United States maintains its position at the forefront of this transformative technology—with all the economic and security benefits that leadership entails.</p>\n"
  }
]